custom_models/sphere_two_arcs/Oldroyd-BLog/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
vertices
(
	//front face
	(-0.1 0 0) //0
	(-0.1 0.01 -0.000425)
	(-0.1 0.01 0.000425) 
	//back face
	(0.1 0 0)	//3
	(0.1 0.01 -0.000425)
	(0.1 0.01 0.000425)
	//sphere axis
	(-0.005 0 0) //6
	(0 0 0)
	(0.005 0 0)
	//front of sphere
	(-0.003535534 0.003532345 0.000150125) //9
	(0 0.00499549 0.000212308)
	(0.003535534 0.003532345 0.000150125)
	//back of sphere
	(-0.003535534 0.003532345 -0.000150125) //12
	(0 0.00499549 -0.000212308)
	(0.003535534 0.003532345 -0.000150125)
	//arc 1
	(-0.007 0 0) //15
	(0.007 0 0)
	//arc 1 front
	(-0.004949747468305833   0.004945283274301867   0.00021017453915782934)
	(0 0.006993686676294527 0.0002972316837425174) //18
	(0.004949747468305833   0.004945283274301867   0.00021017453915782934)
	//arc 1 back
	(-0.004949747468305833   0.004945283274301867   -0.00021017453915782934)
	(0 0.006993686676294527 -0.0002972316837425174) //21
	(0.004949747468305833   0.004945283274301867   -0.00021017453915782934)
	//arc 2
	(-0.009 0 0)
	(0.009 0 0) //24
	//arc 2 front
	(-0.006363961030678928   0.006358221352673828   0.0002702244074886377)
	(0 0.008991882869521534 0.0003821550219546652)
	(0.006363961030678928   0.006358221352673828   0.0002702244074886377) //27
	//arc 2 back
	(-0.006363961030678928   0.006358221352673828   -0.0002702244074886377)
	(0 0.008991882869521534 -0.0003821550219546652)
	(0.006363961030678928   0.006358221352673828   -0.0002702244074886377) //30
	//block points above arc 2
	(-0.015 0.01 0.000425)
	(0.015 0.01 0.000425)
	(-0.015 0.01 -0.000425) //33
	(0.015 0.01 -0.000425)
	(0 0.01 0.000425)
	(0 0.01 -0.000425) //36
	//block points for arc bound
	(-0.01 0 0)
	(0.01 0 0)
	
);

blocks //bottom back start -> bottom front end
(
	hex (0 1 2 0 23 33 31 23) (40 1 20) simpleGrading (1 1 0.0025) //left edge
	hex (23 33 31 23 29 36 35 26) (40 1 50) simpleGrading (1 1 1) //left half of arc boundary
	hex (23 29 26 23 15 21 18 15) (50 1 25) simpleGrading (1 1 0.5) //left half of arc 2
	hex (15 21 18 15 6 13 10 6) (50 1 25) simpleGrading (1 1 1) //left half of arc 1
	hex (8 13 10 8 16 21 18 16) (50 1 25) simpleGrading (1 1 1) //right half of arc 1
	hex (16 21 18 16 24 29 26 24) (50 1 25) simpleGrading (1 1 2) //right half of arc 2
	hex (29 36 35 26 24 34 32 24) (40 1 50) simpleGrading (1 1 1) //right half of arc boundary
	hex (24 34 32 24 3 4 5 3) (40 1 20) simpleGrading (1 1 400) //right edge
);

edges
(
	arc 23 29 (-0.006363961030678928   0.006358221352673828   -0.0002702244074886377) //arc 2 back left
	arc 24 29 (0.006363961030678928   0.006358221352673828   -0.0002702244074886377) //arc 2 back right
	arc 23 26 (-0.006363961030678928   0.006358221352673828   0.0002702244074886377) //arc 2 front left
	arc 24 26 (0.006363961030678928   0.006358221352673828   0.0002702244074886377) //arc 2 front right
	arc 15 21 (-0.004949747468305833   0.004945283274301867   -0.00021017453915782934) //arc 1 back left 
	arc 16 21 (0.004949747468305833   0.004945283274301867   -0.00021017453915782934) //arc 1 back right 
	arc 15 18 (-0.004949747468305833   0.004945283274301867   0.00021017453915782934) //arc 1 front left 
	arc 16 18 (0.004949747468305833   0.004945283274301867   0.00021017453915782934) //arc 1 front right 
	arc 6 13 (-0.003535534 0.003532345 -0.000150125) //sphere back left 
	arc 8 13 (0.003535534 0.003532345 -0.000150125) //sphere back right 
	arc 6 10 (-0.003535534 0.003532345 0.000150125) //sphere front left 
	arc 8 10 (0.003535534 0.003532345 0.000150125) //sphere front right 
);

boundary
(

    inlet
    {
      type patch;
      faces
      (
            (0 1 2 0)
      );
    }
    walls //left front-back; right back-front
    {
    	type wall;
    	faces
    	(
		(2 1 33 31)
		(31 33 36 35)
		(35 36 34 32)
		(32 34 4 5)		
    	);
    }
    front //left bot-top; right top-bot
    {
        type wedge;
        faces
        (
		(0 2 31 23) //left edge
		(23 31 35 26) //left arc bound
		(23 26 18 15) //left arc 2 
		(15 18 10 6) //left arc 1
		(10 18 16 8) //right arc 1
		(18 26 24 16) //right arc 2
		(26 35 32 24) //right arc bound 
		(24 32 5 3)//right edge 		
        );
    }
    back
    {
        type wedge;
        faces
        (
        (0 1 33 23) //left edge
		(23 33 36 29) //left arc bound
		(23 29 21 15) //left arc 2 
		(15 21 13 6) //left arc 1
		(13 21 16 8) //right arc 1
		(21 29 24 16) //right arc 2
		(29 36 34 24) //right arc bound 
		(24 34 4 3)//right edge 
        );
    }
    sphere
    {
        type wall;
        faces
        (
		(6 13 10 6)
		(8 13 10 8)
        );
    }
    outlet
    {
        type patch;
        faces
        (
		(3 4 5 3)
        );
    }
    axis
     { 
           type empty;
           faces  
           (
			(0 23 23 0)
			(23 15 15 23)
			(15 6 6 15)
			(8 16 16 8)
			(16 24 24 16)
			(24 3 3 24)
           );
      }      
);

mergePatchPairs
(
);

// ************************************************************************* //
